tests/load-testing.yml
config:
  target: "https://01bvo40ab2.execute-api.us-west-2.amazonaws.com/sealbuzz-production/sealbuzz"
  phases:
    - duration: 100
      arrivalRate: 5
      name: Warm up
scenarios:
  # We define one scenario:
  - name: "Go through waitroom"
    flow:
      - get:
          url: "/"
          capture:
          - json: $.status
            as: "status"
          strict: false