tests/load-testing.yml
config:
  target: "https://5cmv0s0do2.execute-api.us-east-2.amazonaws.com/prod/beekeeper"
  phases:
    - duration: 400
      arrivalRate: 80
      name: Warm up
    # - duration: 30
    #   arrivalRate: 25
    #   name: Load 1
    # - duration: 10
    #   arrivalRate: 50
    #   name: Load 2
scenarios:
  # We define one scenario:
  - name: "Go through waitroom"
    flow:
      - get:
          url: "/"
          capture:
          - json: $.status
            as: "status"
          strict: false