tests/load-testing.yml
config:
  target: "https://ib6rttod5c.execute-api.us-west-2.amazonaws.com/sealbuzz-production/sealbuzz"
  phases:
    - duration: 100
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 25
      name: Load 1
    - duration: 10
      arrivalRate: 50
      name: Load 2
scenarios:
  # We define one scenario:
  - name: "Go through waitroom"
    flow:
      - get:
          url: "/"
          capture:
          - json: $.status
            as: "status"
          strict: false